// --------------------- 3.3 ---------------------

//# include <stdio.h> // 헤더파일을 의미하며, 여기서 printf를 출력하기 위해서 필요함
//
//int main()
//{
//	printf("Hello, world!\n"); // meaning: calling(by ;) the function
//
//	return 0;
//} 

//해당 프로그램을 바로 실행하는 법은, cmd로 해당 경로에 들어가서 프로그램의 이름을 치면 되는 것이다.

// C 언어에서는 항상 main함수가 있어야함.
// main함수가 없게 되면, 컴파일이 진행되지 않음.
// main함수는 가장 처음에 실행되는 특별한 함수임.

// --------------------- 3.4 ---------------------

//#include <stdio.h>
//
//int main()
//{
//	printf("%s %s\n", "Hello, world!", "And Minho.");
//
//	return 0;
//}

// --------------------- 3.7 ---------------------

//#include <stdio.h>
//
//int main()
//{
//	printf("Hello, world!\n");
//	printf("1234567890");
//
//	return 0;
//}

// --------------------- 3.8 ---------------------

//#include <stdio.h>
//
//int main()
//{
//	printf("Hello, %s\n", "world!");
//
//	return 0;
//}

// --------------------- 4.1~3  ---------------------
// 세미콜론을 생략하면 컴파일 에러가 발생함.
// 단, 내용이 연속되는 코드의 경우 마지막에만 붙이면 된다.

// 중괄호는 함수의 정의, loop, 구조체를 정의할 때도 사용한다.

